[
  {
    "id": "1",
    "name": "Five Pillars of Islam",
    "shortDescription": "The fundamental acts of worship",
    "longDescription": "Learn about the five fundamental acts of worship that form the foundation of Islamic faith: Shahada (declaration of faith), Salah (prayer), Zakat (charity), Sawm (fasting), and Hajj (pilgrimage to Mecca). Understanding these pillars is essential for every Muslim.",
    "imageUrl": "https://via.placeholder.com/200x200/2E7D32/FFFFFF?text=Five+Pillars",
    "url": ""
  },
  {
    "id": "2",
    "name": "Salah (Prayer)",
    "shortDescription": "Daily prayers and worship",
    "longDescription": "Comprehensive guide to Islamic prayer including the five daily prayers, prayer times, proper ablution (Wudu), prayer positions, and the spiritual significance of maintaining regular connection with Allah through Salah.",
    "imageUrl": "https://via.placeholder.com/200x200/1565C0/FFFFFF?text=Salah",
    "url": ""
  },
  {
    "id": "3",
    "name": "99 Names of Allah",
    "shortDescription": "Beautiful names and attributes of Allah",
    "longDescription": "Explore the 99 beautiful names of Allah (Asma ul Husna) and their profound meanings. Each name represents a divine attribute that helps us understand Allah's greatness, mercy, and perfection. Learn how to incorporate these names in daily dhikr and supplication.",
    "imageUrl": "https://via.placeholder.com/200x200/7B1FA2/FFFFFF?text=99+Names",
    "url": ""
  },
  {
    "id": "4",
    "name": "Prophet Muhammad (PBUH)",
    "shortDescription": "Life and teachings of the final messenger",
    "longDescription": "Study the life, character, and teachings of Prophet Muhammad (Peace Be Upon Him), the final messenger of Allah. Learn about his Sunnah, hadith, and how to follow his example in daily life for spiritual growth and moral excellence.",
    "imageUrl": "https://via.placeholder.com/200x200/388E3C/FFFFFF?text=Prophet+PBUH",
    "url": ""
  },
  {
    "id": "5",
    "name": "Islamic Health & Wellness",
    "shortDescription": "Health guidance from Islamic perspective",
    "longDescription": "Discover Islamic principles of health and wellness including the benefits of ablution (Wudu), fasting, dietary laws (Halal), cleanliness, and mental health. Learn how Islamic practices promote both physical and spiritual well-being.",
    "imageUrl": "https://via.placeholder.com/200x200/00796B/FFFFFF?text=Health+Wellness",
    "url": ""
  },
  {
    "id": "6",
    "name": "Ramadan & Fasting",
    "shortDescription": "The holy month and spiritual practices",
    "longDescription": "Everything about the blessed month of Ramadan including the significance of fasting (Sawm), Suhur and Iftar meals, Taraweeh prayers, Laylat al-Qadr, and how to maximize spiritual rewards during this sacred month of mercy and forgiveness.",
    "imageUrl": "https://via.placeholder.com/200x200/D32F2F/FFFFFF?text=Ramadan",
    "url": ""
  },
  {
    "id": "7",
    "name": "Holy Quran",
    "shortDescription": "The final revelation from Allah",
    "longDescription": "Study the Holy Quran, its translation, interpretation (Tafsir), recitation (Qira'at), memorization (Hifz), and the science of Tajweed. Discover the miraculous nature of the Quran and its guidance for all aspects of life.",
    "imageUrl": "https://via.placeholder.com/200x200/1976D2/FFFFFF?text=Holy+Quran",
    "url": ""
  },
  {
    "id": "8",
    "name": "Islamic Science & Knowledge",
    "shortDescription": "Scientific discoveries in Islamic texts",
    "longDescription": "Explore the scientific miracles mentioned in the Quran and Hadith that align with modern scientific discoveries. Learn about the Islamic golden age of science and the contributions of Muslim scientists to human knowledge.",
    "imageUrl": "https://via.placeholder.com/200x200/FF8F00/FFFFFF?text=Islamic+Science",
    "url": ""
  },
  {
    "id": "9",
    "name": "Hajj & Umrah",
    "shortDescription": "Sacred pilgrimage to Mecca",
    "longDescription": "Complete guide to the sacred pilgrimages of Hajj and Umrah including rituals, spiritual meanings, preparation, and the transformative experience of visiting the holy cities of Mecca and Medina.",
    "imageUrl": "https://via.placeholder.com/200x200/9C27B0/FFFFFF?text=Hajj+Umrah",
    "url": ""
  },
  {
    "id": "10",
    "name": "Islamic Ethics & Morals",
    "shortDescription": "Moral guidance and character building",
    "longDescription": "Learn about Islamic ethics, moral values, and character development based on Quranic teachings and the Sunnah of Prophet Muhammad (PBUH). Discover how to build good character and maintain high moral standards in daily life.",
    "imageUrl": "https://via.placeholder.com/200x200/5D4037/FFFFFF?text=Ethics+Morals",
    "url": ""
  },
  {
    "id": "11",
    "name": "Dhikr & Duas",
    "shortDescription": "Remembrance of Allah and supplications",
    "longDescription": "Collection of authentic dhikr (remembrance of Allah) and duas (supplications) from the Quran and Sunnah. Learn the importance of constant remembrance of Allah and various supplications for different occasions and times.",
    "imageUrl": "https://via.placeholder.com/200x200/4CAF50/FFFFFF?text=Dhikr+Duas",
    "url": ""
  },
  {
    "id": "12",
    "name": "Zakat & Charity",
    "shortDescription": "Islamic principles of giving",
    "longDescription": "Understand the obligation of Zakat, its calculation, distribution, and the broader concept of charity (Sadaqah) in Islam. Learn how Islamic financial principles promote social justice and economic equality in society.",
    "imageUrl": "https://via.placeholder.com/200x200/FF5722/FFFFFF?text=Zakat+Charity",
    "url": ""
  },
  {
    "id": "13",
    "name": "Islamic History",
    "shortDescription": "History of Islam and Muslim civilization",
    "longDescription": "Explore the rich history of Islam from the time of Prophet Muhammad (PBUH) through the golden age of Islamic civilization. Learn about great Muslim leaders, scholars, scientists, and their contributions to world civilization.",
    "imageUrl": "https://via.placeholder.com/200x200/6A1B9A/FFFFFF?text=Islamic+History",
    "url": ""
  },
  {
    "id": "14",
    "name": "Islamic Apps & Technology",
    "shortDescription": "Technology serving Islamic needs",
    "longDescription": "Discover how modern technology serves Islamic needs including prayer time apps, Quran apps, Qibla finders, Islamic calendars, and online learning platforms. Learn about digital tools that help Muslims practice their faith in the modern world.",
    "imageUrl": "https://via.placeholder.com/200x200/607D8B/FFFFFF?text=Islamic+Tech",
    "url": ""
  },
  {
    "id": "15",
    "name": "Quran Recitation",
    "shortDescription": "Beautiful recitation and Tajweed",
    "longDescription": "Learn and listen to beautiful Quranic recitations from renowned Qaris around the world. Study the rules of Tajweed (proper pronunciation) and the spiritual benefits of listening to and reciting the Holy Quran with correct pronunciation.",
    "imageUrl": "https://via.placeholder.com/200x200/009688/FFFFFF?text=Recitation",
    "url": ""
  }
]